Public Member Functions | Friends | List of all members
ACAPI::v1::PropertyOperationManager Class Reference
API Infrastructure
Class that administrates the properties of the add-on. Created using CreatePropertyOperationManager. More...
#include <PropertyOperationManager.hpp>
 Inheritance diagram for ACAPI::v1::PropertyOperationManager:
 Public Member Functions
Result< void >  | RegisterAllProperties ()
Registers all properties of the add-on.
Result< void >  | UnregisterAllProperties ()
Unregisters all properties of the add-on.
Result< APIPropertyGroup >  | CreateAPIPropertyGroup (const GS::Guid &groupGuid, GS::UniString groupName, const DG::Icon &icon)
Creates a property group (but does not yet add it).
Result< APIProperty >  | CreateAndAddAPIProperty (APIPropertyGroup &propertyGroup, const GS::Guid &propertyGuid, GS::UniString propertyName, PropertyOperations::CriteriaEnvironmentType criteriaEnvironmentType, PropertyOperations::GroupAvailability groupAvailability, PropertyOperations::PropertyToUseInContext propertyToUseInContext, PropertyOperations::PropertyValueType valueType, bool isSummable, const GS::Array< API_ElemType > &availableForElemsOfTypes, const DG::Icon &icon, std::function< bool(const API_Guid &)> isEvaluableFor, std::function< std::variant< Int32, double, GS::UniString, bool >(const API_Guid &)> getValueFrom)
Creates a new property.
Result< void >  | AddPropertyGroup (APIPropertyGroup propertyGroup)
Adds a property group.
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Friends
Result< PropertyOperationManager > PROPERTYOPERATIONSAPI_EXPORT  | CreatePropertyOperationManager (const API_Token &token)
Create a PropertyOperationManager object that administrates the properties of the add-on.
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
Class that administrates the properties of the add-on. Created using CreatePropertyOperationManager.
Since
Archicad 29
Friends And Related Symbol Documentation
◆ CreatePropertyOperationManager
 Result< PropertyOperationManager > PROPERTYOPERATIONSAPI_EXPORT CreatePropertyOperationManager  |  ( |  const API_Token & |  token | )
friend
Create a PropertyOperationManager object that administrates the properties of the add-on.
Since
Archicad 29
Parameters
token | is the token of the add-on.
Returns
The PropertyOperationManager object. Must stay alive as long as the add-on is alive. Error if token does not belong to add-on.